Repository: 84000/data-translation-memory
Catalog: toh539e-v4.tmx
Source language: bo
Languages: en

source: དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Three Jewels.

source: ཨོྃ་སྨ་ར་སྨ་ར། བི་སྨ་ན་སྐ་ར་མ་ཧཱ་ཛ་བ་ཧཱུྃ་
en: oṃ smara smara| vismanaskara mahājava hūṃ|

source: ཞེས་བརྗོད་ཅིང་རིན་པོ་ཆེ་བརྡར་བས་
en: Say this as a gem is polished.

source: རིན་པོ་ཆེའི་གདུགས་དང་རྒྱལ་མཚན་ལ་སོགས་པའི་ཆར་དཔག་ཏུ་མེད་པ་ནམ་མཁའི་ཁམས་གང་བར་བསམ་ལ་དབུལ་ལོ། །
en: Imagine that by doing this a boundless rain of jeweled parasols, banners, and the like fills the whole of the sky, and offer this.

source: རིན་པོ་ཆེ་བརྡར་བའི་གཟུངས་རྫོགས་སོ།​། །​།
en: This completes “The Dhāraṇī of the Polished Gem.”
